//входни данни
string product = Console.ReadLine(); //"Banana", "Apple", "Kiwi"
string dayType = Console.ReadLine(); //"Weekday", "Weekend"

//тип, име, стойност
double price = 0; //ед. цена за продукта в дадения ден

//проверка кой продукт е закупен
if (product == "Banana")
{
    //какво искаме да се случи ако е въведен банан
    //проверка в кой ден от седмицата е купен
    if (dayType == "Weekday")
    {
        //продуктът е банан и е закупен в делничен ден
        price = 2.50;
    }
    else if (dayType == "Weekend")
    {
        //продуктът е банан и е закупен през уикенда
        price = 2.70;
    }
}
else if (product == "Apple")
{
    //какво искаме да се случи ако е въведенa ябълка
    //проверка в кой ден от седмицата е купена
    if (dayType == "Weekday")
    {
        //продуктът е банан и е закупен в делничен ден
        price = 1.30;
    }
    else if (dayType == "Weekend")
    {
        //продуктът е банан и е закупен през уикенда
        price = 1.60;
    }
}
else if (product == "Kiwi")
{
    //какво искаме да се случи ако е въведенo киви
    //проверка в кой ден от седмицата е купено
    if (dayType == "Weekday")
    {
        //продуктът е банан и е закупен в делничен ден
        price = 2.20;
    }
    else if (dayType == "Weekend")
    {
        //продуктът е банан и е закупен през уикенда
        price = 3.00;
    }
}

//знаем каква е цената на закупения продукт в конкретен ден -> price
Console.WriteLine($"{price:F2}");
