//Оператори за инкрементация / декрементация

// инкрементация - увеличаване на стойността на променлива
// ++ -> специфичен оператор за инкрементация, който увеличава стойността на променливата с 1

//видове инкрементация
//1. пре-инкрементация -> операторът ++ е преди променливата
//2. пост-инкрементация -> операторът ++ е след променливата

int price = 7;

Console.WriteLine(++price); //8
Console.WriteLine(price++); //8
Console.WriteLine(price);   //9

//декрементация - намаляваме на стойността на променлива
// -- -> специфичен оператор за декрементация, който намалява стойността на променливата с 1ś
//видове декрементация
//1. пре-декрементация -> операторът -- е преди променливата
//2. пост-декрементация -> операторът -- е след променливата

int age = 26;

Console.WriteLine(--age); //25
Console.WriteLine(age--); //25
Console.WriteLine(age); //24


//Примери
int count = 0;

count++; //count = 1
++count; //count = 2

Console.WriteLine(count); //2

//Цикли / Loops -> повторение на код
//For цикъл -> определен брой повторения / знаем колко точно пъти искаме да повторим дадено действие

//Пример: отпечатай числата от 1 до 100 -> трябва да използваме for цикъл
//1. начало -> 1
//2. край -> 100
//3. повтаряме -> оптечатваме число
//4. промяна -> +1

for (int number = 1; number <= 100; number++)
{
    //блок от код на for цикъл
    //действието, което се повтаря
    Console.WriteLine(number);
}






