//входни данни
int number = int.Parse(Console.ReadLine()); //число, на което трябва да намерим сумата на цифрите

int sum = 0;
//намираме сумата от цифрите на числото

//повтаряме действия неопределен брой пъти -> while цикъл
//какво повтаряме?
//1. взимаме последната цифра на числото
//2. добавяме последната цифра към сумата на цифрите
//3. премахваме последната цифра

//стоп: нямам повече цифри в числото -> number <= 0
//продължаваме: имаме цифри в числото -> number > 0

while (number > 0)
{
    //1. взимаме последната цифра на числото
    int lastDigit = number % 10;
    //2. добавяме последната цифра към сумата на цифрите
    sum = sum + lastDigit; //sum += lastDigit;
    //3. премахваме последната цифра
    number = number / 10;
}

//нямам повече цифри в числото -> отпечатваме сумата на цифрите
Console.WriteLine(sum);