//входни данни
int n = int.Parse(Console.ReadLine());

//всички числа от n до 1 -> отпечатваме
//повтарящо се действие определен брой пъти -> for цикъл
//1. начало: n
//2. край: 1
//3. повтаряме: отпечатваме
//4. промяна: -1
//намаляващ for цикъл
for (int number = n; number >= 1; number--)
{
    Console.WriteLine(number);
}


//---------------------------------------
//входни данни
//int n = int.Parse(Console.ReadLine());

//While цикъл
//повтаряме: отпечатваме числото и намаляме с 1
//стоп: число < 1
//продължаваме: число >= 1

while (n >= 1)
{
    Console.WriteLine(n);
    n--;
}

