//входни данни
int days = int.Parse(Console.ReadLine()); //брой на дните до изпита

//преминем през всички дни от последния до първия
//повтарящо се действие определен брой пъти -> !!!цикъл!!! -> for цикъл

//1. начало: последния ден -> days
//2. край: първия ден -> 1
//3. повтаряме: отпечатваме съобщение за всеки ден
//4. промяна: -1


//намаляващ for цикъл -> намаляваме стойността 
for (int day = days; day >= 1; day--)
{
    Console.WriteLine($"{day} days before the exam");
}

//обходени са всички дни от последния до първия
Console.WriteLine("The exam has come");